import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Name","TaskType","TaskItemType","NextId","TragetNum","Coin","Exp"],["","","","","","","",""],[1,"每日登陆游戏（{0}/{1}）",1,1,0,1,100,0],[2,"每日在线时长5分钟（{0}/{1}）",1,2,3,5,500,0],[3,"每日在线时长10分钟（{0}/{1}）",1,2,4,10,1000,0],[4,"每日在线时长15分钟（{0}/{1}）",1,2,5,15,1500,0],[5,"每日在线时长20分钟（{0}/{1}）",1,2,6,20,2000,0],[6,"每日在线时长30分钟（{0}/{1}）",1,2,7,30,3000,0],[7,"每日在线时长60分钟（{0}/{1}）",1,2,0,60,6000,0],[8,"每日击杀敌人1个（{0}/{1}）",1,3,9,1,50,0],[9,"每日击杀敌人5个（{0}/{1}）",1,3,10,5,200,0],[10,"每日击杀敌人10个（{0}/{1}）",1,3,11,10,250,0],[11,"每日击杀敌人30个（{0}/{1}）",1,3,12,30,1000,0],[12,"每日击杀敌人50个（{0}/{1}）",1,3,13,50,1000,0],[13,"每日击杀敌人100个（{0}/{1}）",1,3,0,100,2500,0],[14,"每日击杀1个Boss（{0}/{1}）",1,4,15,1,500,0],[15,"每日击杀3个Boss（{0}/{1}）",1,4,16,3,1000,0],[16,"每日击杀10个Boss（{0}/{1}）",1,4,17,10,1500,0],[17,"每日击杀30个Boss（{0}/{1}）",1,4,18,30,2000,0],[18,"每日击杀100个Boss（{0}/{1}）",1,4,0,100,3000,0],[19,"每周登录2天（{0}/{1}）",2,30,20,2,1000,0],[20,"每周登录3天（{0}/{1}）",2,30,21,3,3000,0],[21,"每周登录5天（{0}/{1}）",2,30,22,5,5000,0],[22,"每周登录7天（{0}/{1}）",2,30,0,7,7000,0],[23,"每周时长达到30分钟2天（{0}/{1}）",2,31,24,2,2000,0],[24,"每周时长达到30分钟3天（{0}/{1}）",2,31,25,3,3000,0],[25,"每周时长达到30分钟5天（{0}/{1}）",2,31,26,5,5000,0],[26,"每周时长达到30分钟7天（{0}/{1}）",2,31,0,7,7000,0],[27,"每周击杀敌人50个（{0}/{1}）",2,32,28,50,2500,0],[28,"每周击杀敌人100个（{0}/{1}）",2,32,29,100,2500,0],[29,"每周击杀敌人300个（{0}/{1}）",2,32,30,300,10000,0],[30,"每周击杀敌人500个（{0}/{1}）",2,32,31,500,10000,0],[31,"每周击杀敌人800个（{0}/{1}）",2,32,0,800,15000,0],[32,"每周击杀30个Boss（{0}/{1}）",2,33,33,30,500,0],[33,"每周击杀100个Boss（{0}/{1}）",2,33,34,100,1000,0],[34,"每周击杀200个Boss（{0}/{1}）",2,33,35,200,3000,0],[35,"每周击杀500个Boss（{0}/{1}）",2,33,36,500,5000,0],[36,"每周击杀1000个Boss（{0}/{1}）",2,33,0,1000,10000,0]];
export interface ITaskElement extends IElementBase{
 	/**任务id*/
	id:number
	/**任务名字*/
	Name:string
	/**任务类型
1-每日任务
2-每周任务*/
	TaskType:number
	/**任务类型
1-每日登陆游戏
2-每日在线时长
3-每日击杀敌人
4-每日击杀Boss
30-每周登录天数
31-每周在线时长30分钟次数
32-每周击杀敌人
33-每周击杀Boss*/
	TaskItemType:number
	/**下一阶段的任务ID*/
	NextId:number
	/**目标数*/
	TragetNum:number
	/**获得金币*/
	Coin:number
	/**获得玩家经验*/
	Exp:number
 } 
export class TaskConfig extends ConfigBase<ITaskElement>{
	constructor(){
		super(EXCELDATA);
	}

}